<a href="https://colab.research.google.com/github/RushiG02/ML/blob/master/Assignment_Lannet_Technologies.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import re

In [2]:
d=pd.read_excel("/content/Sample Data.xlsx")
d.dtypes

Reference                      object
Date Y Expected        datetime64[ns]
Date Y Received        datetime64[ns]
Date Created           datetime64[ns]
  Date X received      datetime64[ns]
dtype: object

In [3]:
#Task 1.1
def dates(DataSet):
  colm=[]
  for col in DataSet.columns:
    if DataSet[col].dtype=='datetime64[ns]':
      colm.append(col)
    if DataSet[col].dtype=='object':
      match = re.search(r'\d{2}-\d{2}',str(DataSet[col][1]))
      if match:
        DataSet[col]=pd.to_datetime(DataSet[col])
        colm.append(col)
  return(colm)

In [4]:
dates(d)

['Date Y Expected\xa0\xa0\xa0',
 'Date Y Received\xa0\xa0\xa0\xa0',
 'Date Created\xa0\xa0\xa0',
 '\xa0 Date X received']

**If dates are of different format throughout the column then pass the dataset in 'change_format(DataSet)' which converts all dates in one format**

In [5]:
def change_format(DataSet):
  c=dates(d)
  for i in c:
    DataSet[i]=pd.to_datetime(DataSet[i])
    DataSet[i]=DataSet[i].dt.strftime('%Y-%m-%d')
    DataSet[i]=pd.to_datetime(DataSet[i])
  return(DataSet)

In [6]:
#Task 1.2
from itertools import combinations
def DateDifference(DataSet):
  c=dates(DataSet)
  comb = combinations(c, 2)
  for i in comb:
    DataSet[str(i[0])+'-'+str(i[1])]=abs(DataSet[i[0]]-DataSet[i[1]])

  return(DataSet)

In [7]:
change_format(d)

   Reference      Date Y Expected     ... Date Created      Date X received
0  1234                   2018-06-01  ...      2018-04-01        2018-05-15
1  1234                   2018-06-01  ...      2018-04-01        2018-05-15
2  1234                   2018-06-01  ...      2018-04-01        2018-05-15
3  1235                   2018-09-09  ...      2018-04-10        2018-05-10
4  1236                          NaT  ...      2018-05-01               NaT
5  1237                   2018-08-10  ...      2018-04-20        2018-04-21

[6 rows x 5 columns]

In [8]:
DateDifference(d)

   Reference       ... Date Created   -  Date X received
0  1234            ...                           44 days
1  1234            ...                           44 days
2  1234            ...                           44 days
3  1235            ...                           30 days
4  1236            ...                               NaT
5  1237            ...                            1 days

[6 rows x 11 columns]

In [9]:
#Task 1.3
def DeleteColumns(DataSet):
  c=dates(DataSet)
  DataSet = DataSet.drop(c, axis=1)
  return(DataSet)

In [10]:
DeleteColumns(d)

   Reference       ... Date Created   -  Date X received
0  1234            ...                           44 days
1  1234            ...                           44 days
2  1234            ...                           44 days
3  1235            ...                           30 days
4  1236            ...                               NaT
5  1237            ...                            1 days

[6 rows x 7 columns]

In [11]:
#Task 2.1

def Corrln(DataSet):
  corr=DataSet.corr(method ='pearson')
  x=[]
  for i in range(len(corr.columns)):
    for j in range(i+1,len(corr.columns)):
      if corr.iloc[i,j]>0.85:
        x.append(corr.columns[j])
        x.append(corr.columns[i])
  DataSet=DataSet.drop(set(x),axis=1)
  return(DataSet)

In [12]:
Data=pd.read_csv("/content/sample_data/california_housing_test.csv")
Corrln(Data)

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 5 columns]

***Task 3.1***

  -Training data used to build ML model and testing data represents real life data which validates model.


  -As the test set is there only for performance assessment model, it should not be used in any stage of model building, including imputation , feature selection, normalization,etc.

  *Thus you should do preprocessing before train-test split or do it on train data first*

***Task 4.1***

**How to Speed up Your Python Code**

1. Optimization:
      Reuse objects,Reduce the number of iterations and Avoid recursion.

2. Use builtin functions and libraries.

3. Vectorize your Functions, use numpy

4. Try to use multiprocessing

In [13]:
d = {'name':['bob','john','uyt','tr','yg'],'address':['123 6th Street,Sterling VA 20165-7513','567 7th Street, Wilmington NC 28411','57 7th Street, Wilmington NC 28411-9765','567 7th Street, Wilmington NC 28001','123 6th Street,zip-20165-7511, Sterling VA ']}
df = pd.DataFrame(d)

In [14]:
df.dtypes

name       object
address    object
dtype: object

In [15]:
#Task 5.1
def ZipCode(DataSet):
  addr_cols = [col for col in df.columns if 'address' in col]
  for i in addr_cols:
    DataSet['zip-'+i] = df[i].str.extract(r'(\d{5}\-?\d{0,4})')
    df['zip-'+i]=df['zip-'+i].str.extract(r'(\d{5})')

  return(DataSet)

In [16]:
ZipCode(df)

   name                                      address zip-address
0   bob        123 6th Street,Sterling VA 20165-7513       20165
1  john          567 7th Street, Wilmington NC 28411       28411
2   uyt      57 7th Street, Wilmington NC 28411-9765       28411
3    tr          567 7th Street, Wilmington NC 28001       28001
4    yg  123 6th Street,zip-20165-7511, Sterling VA        20165

In [17]:
data = [{'one': '3', 'two': 'two raods'}, 
         {'one': '7', 'two': 'diverrged in a yullow'}, 
        {'one': '8', 'two': 'waod and surry I'}, 
        {'one': '9', 'two': 'culd not travl bouth'}]
df = pd.DataFrame(data)
df

  one                    two
0   3              two raods
1   7  diverrged in a yullow
2   8       waod and surry I
3   9   culd not travl bouth

In [18]:
#Task 6.1

from textblob import TextBlob
def typo(DataSet):
  addr_cols = [col for col in df.columns if 'address' in col]
  for i in addr_cols:
    DataSet[i] = DataSet[i].apply(lambda txt: ''.join(textblob.TextBlob(txt).correct()))
  return(DataSet)